src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Хозрасчетный</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <chartOfAccounts>Checked</chartOfAccounts>
    <correspondence>Checked</correspondence>
  </extension>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:AccountingRegister>

src/Documents/ДвижениеМногооборотнойТары/ДвижениеМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМногооборотнойТары</name>
  <basedOn>Document.МаршрутныйЛист</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыДвиженийМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПолучатель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузополучатели</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаВодителя</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/УчетТоваров/Module.bsl
&Перед("СформироватьДвиженияПоступлениеТоваров")
Процедура Базар_СформироватьДвиженияПоступлениеТоваров(ТаблицаТовары, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаТовары) Тогда
		Возврат;
	КонецЕсли;
	
	ВидНоменклатурыТара = ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", "ВидыНоменклатуры", "МногооборотнаяТара");
	
	Если ЗначениеЗаполнено(ВидНоменклатурыТара) тогда
		
		СчетаМТ = МногооборотнаяТараСервер.СчетаМногооборотнойТары();
		
		Если МногооборотнаяТараСервер.ПредопределенныеСчетаУчетаМногооборотнойТарыЗаполнены(СчетаМТ) тогда
			
			РеквизитыДокумента = ТаблицаРеквизиты.Получить(0);
			КоличествоСтрок = ТаблицаТовары.Количество();
			НомерСтроки = 1;
			Пока НомерСтроки <= КоличествоСтрок цикл
				
				СтрокаТовары = ТаблицаТовары.Получить(НомерСтроки - 1);
				Если СтрокаТовары.Номенклатура.ВидНоменклатуры = ВидНоменклатурыТара тогда
					
					Проводка = Движения.Хозрасчетный.Добавить();
					
					Проводка.Период       = РеквизитыДокумента.Период;
					Проводка.Организация  = РеквизитыДокумента.Организация;
					Проводка.КоличествоДт = СтрокаТовары.Количество;
					Проводка.КоличествоКт = СтрокаТовары.Количество;
					Проводка.Содержание   = СокрЛП(СтрокаТовары.Содержание);
					Проводка.СчетДт       = СчетаМТ.МногооборотнаяТараОстатки;
					Проводка.СчетКт       = СчетаМТ.МногооборотнаяТараПоставщики;
					
					ЗначенияСубконто = Новый Массив;
					ЗначенияСубконто.Добавить(РеквизитыДокумента.Контрагент);
					ЗначенияСубконто.Добавить(СтрокаТовары.Номенклатура);
					ЗначенияСубконто.Добавить(РеквизитыДокумента.Регистратор);
					
					Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
						Проводка.СчетДт,
						Проводка.СубконтоДт,
						ЗначенияСубконто
					);
					
					Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
						Проводка.СчетКт,
						Проводка.СубконтоКт,
						ЗначенияСубконто
					);
					
					ТаблицаТовары.Удалить(НомерСтроки - 1);
					КоличествоСтрок = ТаблицаТовары.Количество();
					НомерСтроки = НомерСтроки - 1;
					
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
